# 8. 데이터 선택 (iloc)
위치를 이용하여 원하는 row에서 원하는 col 선택

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = '지원번호')
df

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [2]:
df.iloc[0] #0번째 위치의 데이터

이름         강민수
학교         세종초
국어         100
영어          85
수학         100
과학          85
사회         100
SW특기    Python
Name: 1번, dtype: object

In [3]:
df.iloc[3] # 4번째 위치의 데이터

이름      정태경
학교      덕소초
국어       85
영어      100
수학       85
과학      100
사회       85
SW특기    NaN
Name: 4번, dtype: object

In [4]:
df.iloc[0:5] #0 ~ 4번째 위치의 데이터

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [5]:
df.iloc[0,1] # 0번째 위치의 1번째(학교) 데이터

'세종초'

In [6]:
df.iloc[3,2] #4번 위치 학생의 2번째(국어) 데이터

85

In [7]:
df.iloc[[0,1], 2] #0, 1번째 위치의 학생의 2번째(국어) 데이터

지원번호
1번    100
2번     95
Name: 국어, dtype: int64

In [8]:
df.iloc[[0,1],[3,4]] #0, 1번째 위치의 학생의 3,4 번째 데이터(영어, 수학)

      영어   수학
지원번호
1번    85  100
2번    90   95

In [9]:
df.iloc[0:4, 2:7] #0~3번째 위치의 학생 중에서, 2 ~ 6번째 데이터(국어:사회)

       국어   영어   수학   과학   사회
지원번호
1번    100   85  100   85  100
2번     95   90   95   90   95
3번     90   95   90   95   90
4번     85  100   85  100   85